// قراءة معرف المنتج من رابط الصفحة
const urlParams = new URLSearchParams(window.location.search);
const productId = urlParams.get("id");

// بيانات المنتج (كمثال)
const products = [
  {
    id: "1",
    name: "ميدالية لوحة سيارة ملكي بالاسم",
    description:
      "ميدالية لوحة سيارة ملكي مخصصة بالاسم، تم تصميمها خصيصًا للأفراد الذين يرغبون في أضافة لمسة شخصية إلى مفاتيحهم. تأتي هذه الميدالية المصنوعة من مادة عالية الجودة مطلية بالذهب و الفضة، مما يضيف إليها سحرًا فريدًا وجمالًا لا مثيل له.تعتبر هذه الميدالية منتجًا فريدًا، إذ تتيح للمستخدمين إمكانية تخصيصها بالاسم الذي يرغبون فيه. بإمكانك أن تضيف اسمك الخاص أو اسم شخص مميز في حياتك إلى الميدالية، وبذلك تضمن لها لمسة شخصية تجعلها لا تنسى. بالإضافة إلى ذلك، فإن شكلها المستوحى من لوحة السيارة الملكية يعكس أناقة وفخامة لا تضاهى.تأتي الميدالية بتصميم سهل الاستخدام، حيث يمكنك تعليق المفاتيح بها دون أي جهد. ستكون مفاتيحك دائمًا في متناول يدك وستكون على دراية بموقعها في جميع الأوقات. بفضل الطلاء الذهبي والفضي، فإن الميدالية تعكس الضوء وتضفي بريقًا رائعًا على مفاتيحك. تصلح هذه الميدالية المذهلة لمناسبات عديدة، وهي خيار رائع كهدية لأحبائك في أي مناسبة خاصة. يمكنك أن تضفي اللمسة الشخصية إلى هدية بسيطة، وتجعلها تبدو فريدة ومميزة. اجعل من تصميمك الخاص للميدالية هدية تذكار مميز لصديق في عيد ميلاديمكنك طلب ميدالية لوحة السيارة الملكية المخصصة بالاسم من متجر العروس. نحن نضمن لك أعلى مستوى من الجودة والمتانة، بينما نحرص على توفير تجربة تسوق مريحة وممتعة. قد تكون الميدالية المصنوعة بعناية وفريدة من نوعها هي الطريقة المثلى للتعبير عن أسلوبك الشخصي وإضافة لمسة أنيقة إلى مجموعة مفاتيحك. فلا تفوت الفرصة واحصل على ميدالية لوحة السيارة الملكية المخصصة بالاسم الآن واجعل مفاتيحك تتألق بأناقة لا مثيل لها.",
    price: 70,
    oldPrice: 100,
    image: "image/p4.jpeg",
  },
  {
    id: "2",
    name: "ميدالية لوحة سيارة ملكي بالاسم",
    description:
      "ميدالية لوحة سيارة ملكي مخصصة بالاسم، تم تصميمها خصيصًا للأفراد الذين يرغبون في أضافة لمسة شخصية إلى مفاتيحهم. تأتي هذه الميدالية المصنوعة من مادة عالية الجودة مطلية بالذهب و الفضة، مما يضيف إليها سحرًا فريدًا وجمالًا لا مثيل له.تعتبر هذه الميدالية منتجًا فريدًا، إذ تتيح للمستخدمين إمكانية تخصيصها بالاسم الذي يرغبون فيه. بإمكانك أن تضيف اسمك الخاص أو اسم شخص مميز في حياتك إلى الميدالية، وبذلك تضمن لها لمسة شخصية تجعلها لا تنسى. بالإضافة إلى ذلك، فإن شكلها المستوحى من لوحة السيارة الملكية يعكس أناقة وفخامة لا تضاهى.تأتي الميدالية بتصميم سهل الاستخدام، حيث يمكنك تعليق المفاتيح بها دون أي جهد. ستكون مفاتيحك دائمًا في متناول يدك وستكون على دراية بموقعها في جميع الأوقات. بفضل الطلاء الذهبي والفضي، فإن الميدالية تعكس الضوء وتضفي بريقًا رائعًا على مفاتيحك. تصلح هذه الميدالية المذهلة لمناسبات عديدة، وهي خيار رائع كهدية لأحبائك في أي مناسبة خاصة. يمكنك أن تضفي اللمسة الشخصية إلى هدية بسيطة، وتجعلها تبدو فريدة ومميزة. اجعل من تصميمك الخاص للميدالية هدية تذكار مميز لصديق في عيد ميلاديمكنك طلب ميدالية لوحة السيارة الملكية المخصصة بالاسم من متجر العروس. نحن نضمن لك أعلى مستوى من الجودة والمتانة، بينما نحرص على توفير تجربة تسوق مريحة وممتعة. قد تكون الميدالية المصنوعة بعناية وفريدة من نوعها هي الطريقة المثلى للتعبير عن أسلوبك الشخصي وإضافة لمسة أنيقة إلى مجموعة مفاتيحك. فلا تفوت الفرصة واحصل على ميدالية لوحة السيارة الملكية المخصصة بالاسم الآن واجعل مفاتيحك تتألق بأناقة لا مثيل لها.",
    price: 50,
    oldPrice: 80,
    image: "image/p2.jpeg",
  },
  // أضف بيانات منتجات أخرى
];

// البحث عن المنتج بناءً على ID
const product = products.find((item) => item.id === productId);

// عرض بيانات المنتج في الصفحة
if (product) {
  const productInfo = document.querySelector(".single-product");
  productInfo.innerHTML = `
      <div class="single-product">
      <div class="product-image">
        <img src="${product.image}" alt="${product.name}" />
      </div>
      <div class="product-details">
        <h1 class="product-title">${product.name}</h1>
        <p class="product-description">
        ${product.description}
        </p>
        <p class="product-price">$${product.price}</p>
        <button class="add-to-cart-btn">
          <a href="https://mtlealaroos.com/ar/cart">اشتري الان</a>
        </button>
      </div>
    </div>
  `;
} else {
  document.getElementById("product-info").innerHTML = "<p>المنتج غير موجود</p>";
}
